# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
first = pd.Series(np.random.randint(1,5,size=100))
second = pd.Series(np.random.randint(1,4,size=100))
third = pd.Series(np.random.randint(10000,30000,size=100))

In [9]:
first

0     1
1     3
2     2
3     1
4     3
     ..
95    4
96    1
97    3
98    1
99    4
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [11]:
df = pd.concat([first, second, third], axis = 1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [14]:
df.columns = ['bedrs','bathrs','price_sqr_meter']

In [15]:
df

    bedrs  bathrs  price_sqr_meter
0       1       1            25401
1       3       3            21244
2       2       2            14538
3       1       2            22638
4       3       2            29082
..    ...     ...              ...
95      4       2            29684
96      1       1            10879
97      3       3            26813
98      1       2            20964
99      4       3            24462

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [23]:
bigcolum = pd.concat([first, second, third]).to_frame()
bigcolum

        0
0       1
1       3
2       2
3       1
4       3
..    ...
95  29684
96  10879
97  26813
98  20964
99  24462

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [21]:
len(bigcolum)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [19]:
bigcolum.reset_index(drop=True, inplace=True)

In [24]:
bigcolum

        0
0       1
1       3
2       2
3       1
4       3
..    ...
95  29684
96  10879
97  26813
98  20964
99  24462

[300 rows x 1 columns]